АлогистикТест2/src/Documents/алк_ИнвентаризацияШтабелей/алк_ИнвентаризацияШтабелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ИнвентаризацияШтабелей</name>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>EnumRef.алк_ВидыРегистровИнвентаризации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишкиКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишкиОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НедостачаКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НедостачаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недостача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыОрганизации/алк_ЗапасыОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСменыНов</name>
    <comment>Для перемещения из измерения в реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_Отходы/алк_Отходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_Отходы</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>EnumRef.алк_АналитикаЩепа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаОборотаОтходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииНаОтветхранении/алк_УчетЛесопродукцииНаОтветхранении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииНаОтветхранении</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияТД</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииГОСТ/алк_УчетЛесопродукцииГОСТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииГОСТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ВидыРегистровИнвентаризации/алк_ВидыРегистровИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыРегистровИнвентаризации</name>
  <enumValues>
    <name>ЗапасыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииНаОтветхранении</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииГОСТ</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ИнвентаризацияШтабелей/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКоманд

&НаСервере
Процедура ЗаполнитьОстаткамиСНулевымКоличествомНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток КАК КоличествоУчет,
	|	алк_ЗапасыОрганизацииОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
	|	алк_ЗапасыОрганизацииОстатки.Характеристика,
	|	алк_ЗапасыОрганизацииОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(&ПериодСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_ЗапасыОрганизацииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ЗапасыОрганизацииОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейка,
	|	алк_ПараметрыХарактеристик.Сорт
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПериодСреза", Объект.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
	Для каждого стрЗапас Из Объект.Запасы Цикл
		
		Если стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт >= 0 Тогда
			// недостача
			стрЗапас.НедостачаКоличество = стрЗапас.КоличествоУчет - стрЗапас.КоличествоФакт;
			стрЗапас.НедостачаОбъем = стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт;
			
		Иначе
			// излишки
			стрЗапас.ИзлишкиКоличество = стрЗапас.КоличествоФакт - стрЗапас.КоличествоУчет;
			стрЗапас.ИзлишкиОбъем = стрЗапас.ОбъемФакт - стрЗапас.ОбъемУчет;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиСНулевымКоличеством(Команда)
	ЗаполнитьОстаткамиСНулевымКоличествомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ВидРегистра) Тогда
		Возврат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	ТекстЗапасыОрганизации = 
	"ВЫБРАТЬ
	|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток КАК КоличествоУчет,
	|	алк_ЗапасыОрганизацииОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
	|	алк_ЗапасыОрганизацииОстатки.Характеристика,
	|	алк_ЗапасыОрганизацииОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(
	|			&ПериодСреза,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Сертификат = &Сертификат) КАК алк_ЗапасыОрганизацииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ЗапасыОрганизацииОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейка,
	|	алк_ПараметрыХарактеристик.Сорт
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстОтходы = 
	"ВЫБРАТЬ
	|	алк_ОтходыОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_ОтходыОстатки.Номенклатура,
	|	алк_ОтходыОстатки.Характеристика
	|ИЗ
	|	РегистрНакопления.алк_Отходы.Остатки(, ) КАК алк_ОтходыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОтходыОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстУчетЛесопродукцииНаОтветхранении = 
	"ВЫБРАТЬ
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК КоличествоУчет,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(&ПериодСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Сертификат = &Сертификат
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель,
	|	алк_ПараметрыХарактеристик.Сорт
	|АВТОУПОРЯДОЧИВАНИЕ";

	
	ТекстУчетЛесопродукцииГОСТ = 
	"ВЫБРАТЬ
	|	алк_УчетЛесопродукцииГОСТОстатки.КоличествоОстаток КАК КоличествоУчет,
	|	алк_УчетЛесопродукцииГОСТОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_УчетЛесопродукцииГОСТОстатки.Номенклатура,
	|	алк_УчетЛесопродукцииГОСТОстатки.Характеристика,
	|	алк_УчетЛесопродукцииГОСТОстатки.Штабель КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Остатки(&ПериодСреза, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_УчетЛесопродукцииГОСТОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_УчетЛесопродукцииГОСТОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ
	|АВТОУПОРЯДОЧИВАНИЕ";

	
	
	Если Объект.ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации Тогда 	
		Запрос.Текст =	ТекстЗапасыОрганизации;
	КонецЕсли;
	
	Если Объект.ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.Отходы Тогда 	
		Запрос.Текст =	ТекстОтходы;
	КонецЕсли;
	
	Если Объект.ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении Тогда 	
		Запрос.Текст =	ТекстУчетЛесопродукцииНаОтветхранении;
	КонецЕсли;
	
	Если Объект.ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииГОСТ Тогда 	
		Запрос.Текст =	ТекстУчетЛесопродукцииГОСТ;
	КонецЕсли;                                                              	
	
	Запрос.УстановитьПараметр("ПериодСреза", 		Объект.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сертификат", 		Объект.Сертификат);

	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
	Для каждого стрЗапас Из Объект.Запасы Цикл
		
		Если стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт >= 0 Тогда
			// недостача
			стрЗапас.НедостачаКоличество = стрЗапас.КоличествоУчет - стрЗапас.КоличествоФакт;
			стрЗапас.НедостачаОбъем = стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт;
			
		Иначе
			// излишки
			стрЗапас.ИзлишкиКоличество = стрЗапас.КоличествоФакт - стрЗапас.КоличествоУчет;
			стрЗапас.ИзлишкиОбъем = стрЗапас.ОбъемФакт - стрЗапас.ОбъемУчет;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	
	ЗаполнитьОстаткамиНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	 УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти 


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ЗапасыКоличествоФактПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтрокиФакт(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	стрЗапас = Элементы.Запасы.ТекущиеДанные;
	
	Если стрЗапас = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Если стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт >= 0 Тогда
		// недостача
		стрЗапас.НедостачаКоличество = стрЗапас.КоличествоУчет - стрЗапас.КоличествоФакт;
		стрЗапас.НедостачаОбъем = стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт;
		
		стрЗапас.ИзлишкиКоличество = 0;
		стрЗапас.ИзлишкиОбъем = 0;

	Иначе
		// излишки
		стрЗапас.ИзлишкиКоличество = стрЗапас.КоличествоФакт - стрЗапас.КоличествоУчет;
		стрЗапас.ИзлишкиОбъем = стрЗапас.ОбъемФакт - стрЗапас.ОбъемУчет;
		
		стрЗапас.НедостачаКоличество = 0;
		стрЗапас.НедостачаОбъем = 0;
		
	КонецЕсли; 
	
КонецПроцедуры

	
#КонецОбласти 

Процедура Конец()	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьУчетНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ВидРегистра) Тогда
		Возврат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	ТекстЗапасыОрганизации = 
	"ВЫБРАТЬ
	|	СУММА(алк_ЗапасыОрганизацииОстатки.КоличествоОстаток) КАК КоличествоУчет,
	|	СУММА(алк_ЗапасыОрганизацииОстатки.ОбъемОстаток) КАК ОбъемУчет,
	|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
	|	алк_ЗапасыОрганизацииОстатки.Характеристика,
	|	алк_ЗапасыОрганизацииОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(
	|			&ПериодСреза,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Сертификат = &Сертификат
	|				И Ячейка = &Штабель) КАК алк_ЗапасыОрганизацииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
	|	алк_ЗапасыОрганизацииОстатки.Характеристика,
	|	алк_ЗапасыОрганизацииОстатки.Ячейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстОХ = 
	"ВЫБРАТЬ
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток КАК КоличествоУчет,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.ОбъемОстаток КАК ОбъемУчет,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика,
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель КАК Ячейка
	|ИЗ
	|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
	|			&ПериодСреза,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Сертификат = &Сертификат
	|				И Штабель = &Штабель) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.Текст = ?(Объект.ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации, ТекстЗапасыОрганизации, ТекстОХ);
	
	Запрос.УстановитьПараметр("ПериодСреза", 		Объект.Дата);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сертификат", 		Объект.Сертификат);
	Запрос.УстановитьПараметр("Штабель", 			Штабель);
	
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	//Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Для каждого стрЗапас Из Объект.Запасы Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Характеристика", стрЗапас.Характеристика);
		
		Строки = ТЗ.НайтиСтроки(Отбор);
		
		Если Строки.Количество() > 0 Тогда 			
			стрЗапас.ОбъемУчет 			= Строки[0].ОбъемУчет;  
			стрЗапас.КоличествоУчет 	= Строки[0].КоличествоУчет;
			ТЗ.Удалить(Строки[0]);
		Иначе
			стрЗапас.ОбъемУчет 			= 0;  
			стрЗапас.КоличествоУчет 	= 0;
		КонецЕсли;	
		
	КонецЦикла;  
	
	// добавляем то чего нет.
	Для каждого СтрТЗ Из ТЗ Цикл
		
		НоваяСтр = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, СтрТЗ);
		//НоваяСтр.ОбъемУчет 			= СтрТЗ.ОбъемУчет;	  
		//НоваяСтр.КоличествоУчет 	= СтрТЗ.КоличествоУчет;
		
	КонецЦикла; 
	
	Для каждого стрЗапас Из Объект.Запасы Цикл
			
		Если стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт >= 0 Тогда 			  
			// недостача
			стрЗапас.НедостачаОбъем 	= стрЗапас.ОбъемУчет - стрЗапас.ОбъемФакт;
			стрЗапас.ИзлишкиОбъем 		= 0;
		Иначе
			// излишки
			стрЗапас.ИзлишкиОбъем 		= стрЗапас.ОбъемФакт - стрЗапас.ОбъемУчет;
			стрЗапас.НедостачаОбъем 	= 0;  
		КонецЕсли; 
		
		Если стрЗапас.КоличествоУчет - стрЗапас.КоличествоФакт >= 0 Тогда   					   
			// недостача
			стрЗапас.НедостачаКоличество 	= стрЗапас.КоличествоУчет - стрЗапас.КоличествоФакт;
			стрЗапас.ИзлишкиКоличество 		= 0; 
		Иначе
			// излишки
			стрЗапас.ИзлишкиКоличество 		= стрЗапас.КоличествоФакт - стрЗапас.КоличествоУчет;
			стрЗапас.НедостачаКоличество 	= 0; 	  				
		КонецЕсли; 

		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьУчет(Команда)
	ПерезаполнитьУчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере() 
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);

КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
